[
{
  "model": "scraping.city",
  "pk": 2,
  "fields": {
    "name": "Москва",
    "slug": "moskva"
  }
},
{
  "model": "scraping.city",
  "pk": 3,
  "fields": {
    "name": "Санкт-Петербург",
    "slug": "sankt-peterburg"
  }
},
{
  "model": "scraping.city",
  "pk": 4,
  "fields": {
    "name": "Казань",
    "slug": "kazan"
  }
},
{
  "model": "scraping.language",
  "pk": 1,
  "fields": {
    "name": "Python",
    "slug": "python"
  }
},
{
  "model": "scraping.language",
  "pk": 2,
  "fields": {
    "name": "JavaScript",
    "slug": "javascript"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 1,
  "fields": {
    "url": "https://spb.hh.ru/vacancy/73505768?from=vacancy_search_list&query=python",
    "title": "Python-разработчик",
    "company": "ЗАО ИСТ",
    "description": "Команда по разработке системы видеоконференцсвязи приглашает Python-разработчика\r\n\r\nТребования:\r\n\r\nУверенное знание Python(asyncio);\r\nОпыт использования библиотек aiohttp, flask, requests;\r\nПонимание взаимодействия с frontend посредством websockets;\r\nИспользование в качестве основного языка Python версии >=3.5;\r\nБудет плюсом:\r\n\r\nОпыт работы GraphQL;\r\nОпыт работы с Redis (pub/sub), RabbitMQ;\r\nОпыт работы с PostgresQL;\r\nИспользование Linux как основной среды разработки;\r\nУмение работать с Git, Gitlab;\r\nОбязанности:\r\n\r\nУчаcтие в разработке серверной части приложений(REST, GraphQL);\r\nУчастие в разработке брокера сообщений на базе Redis Pub/Sub;\r\nПоддержка и оптимизация текущих решений;\r\nРеализация нового функционала;",
    "city": 3,
    "language": 1,
    "timestamp": "2022-12-08"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 2,
  "fields": {
    "url": "https://spb.hh.ru/vacancy/73433068?from=vacancy_search_list&query=python",
    "title": "Программист Python",
    "company": "АО Концерн радиостроения Вега, филиал в г. Санкт-Петербург",
    "description": "Мы создаём коммуникационные сервисы, системы удаленного управления и программно-аппаратные комплексы обработки данных с систем дистанционного зондирования земли.\r\n\r\nНад чем тебе предстоит работать:\r\n\r\nразработка интеллектуальных систем\r\nучастие в разработке ПО для обработки и визуализации данных с различных летательных аппаратов (материалы аэро- и лидарной фотосъёмки, видео, телеметрические данные)\r\nЧто для нас важно :\r\n\r\nЗнание Python и его окружения (стандартные библиотеки и библиотеки на базе фреймворков)\r\nпокрытие кода тестами (pytest, coverage)\r\nописание проекта как библиотеки\r\nиспользование линтеров\r\nопыт работы с базами данных (PostgreSQL, MongoDB)\r\nработа с системами контроля версий, понимание подходов CI/CD",
    "city": 3,
    "language": 1,
    "timestamp": "2022-12-08"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 3,
  "fields": {
    "url": "https://spb.hh.ru/vacancy/72213862?hhtmFrom=vacancy&hhtmFromLabel=vacancy_immediate_redirect",
    "title": "Senior Java developer",
    "company": "Сбер",
    "description": "Команда «Портфельная аналитика»\r\n\r\nМы делаем уникальный сервис, который предоставляет информацию по всем инвестиционным продуктам СберБанка. Это и брокерские счета, и стратегии, и доверительное управление, и страховые продукты.\r\n\r\nНаш сервис дает клиенту возможность оценить доходность своего портфеля за разные периоды, от месяца и до трёх лет, в разных валютах. Показывает портфель в различных разрезах: по активам, уровням риска и по валютам. Также, дает комплексную оценку клиентского портфеля.\r\n\r\nВ наших планах: максимальная детализация выводимой информации, новые аналитические отчеты, использование ИИ для определения стратегии и персональных рекомендаций, использование People-Like-Me.\r\n\r\nНас ждет интересная, важная и нескучная работа!\r\n\r\nОбязанности\r\n\r\nПоддержка генерации и отбора идей, оценка трудоемкости\r\nДекомпозиция и анализ задач бэклога\r\nПроектирование решения, в том числе разработка детальной внутренней архитектуры сервиса, включая интеграционные сценарии\r\nРеализация интеграции со смежными сервисами (в том числе API)\r\nУстранение дефектов проектирования и реализации на всех стадиях ЖЦ ПО\r\nРазработка автоматических модульных тестов, автоматических скриптов и тестов развертывания\r\nСборка и развертывание сервисов на стендах разработки и тестирования\r\nПодготовка и настройка среды разработки\r\nРазвертывание ПО разработки на рабочем месте разработчика\r\nУчастие в планирование релизов\r\nТребования\r\n\r\nОпыт от 3х лет разработки высоко-нагруженных и отказоустойчивых фронтальных систем;\r\nЗнание методологий разработки программного обеспечения с акцентом на гибкие методологии;\r\nУмение разбираться в чужом коде, писать чистый и понятный код для других разработчиков;\r\nЗнание шаблонов проектирования ПО и умение применять их на практике;\r\nЗаконченное высшее образование;\r\nОпыт работы с языками программирования и технологиями: Java, SQL, Spring, Maven, Git, JUnit;\r\nОтличное знание git, принципов работы с branches gitflow;\r\nНавыки работы с Jenkins на уровне создания job, playbooks;\r\nУмение читать документацию на английском языке.",
    "city": 4,
    "language": 2,
    "timestamp": "2022-12-08"
  }
}
]
